#include <iostream>
#include <string>

using namespace std;
string errcode[30]={
	"非法整数或字符或标识符" , //0
	"符号表溢出", //1
	"!号后应是=" ,  //2
	"缺少单引号",//3
    "字符串溢出",//4
    "标识符定义重复",//5
    "函数未定义",//6
    "缺少CONST关键字",//7
    "变量或常量未定义",//8
    "函数参数个数不匹配",//9
    "缺少等号",//10
    "缺少标识符",//11
    "缺少整数",//12
    "数组越界",//13
    "类型不匹配",//14
    "缺少分号",//15
    "缺少类型标识符",//16
    "缺少正负号",//17
    "缺少右中括号",//18
    "缺少左小括号",//19
    "缺少右小括号",//20
    "缺少左大括号",//21
    "缺少右大括号",//22
    "函数缺少返回值",//23
    "函数不应有返回值",//24
    "缺少main函数",//25
    "缺少WHILE",//26
};
